src/Catalogs/БЗ_СтатьиБазыЗнаний/БЗ_СтатьиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_СтатьиБазыЗнаний</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеСодержания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.БЗ_ПользователиБазыЗнаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержание</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСворачивание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Картинки</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Граница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Таблицы</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбтеканиеТекста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаСтилейHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстТаблицыHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.БЗ_КатегорииБазыЗнаний</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сноски</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаТип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаОткрывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаПодсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГиперссылки</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Открывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/БЗ_БазаЗнанийHTMLВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЩАЯ ФУНКЦИОНАЛЬНОСТЬ

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ СТРАНИЦ БАЗЫ ЗНАНИЙ

Функция ПолучитьДанныеГлавнойСтраницы(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентГлавнойСтраницы(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"База знаний (основная)");
	
КонецФункции

Функция ПолучитьДанныеСтраницыКатегория(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	КатегорияСсылка			= Справочники.БЗ_КатегорииБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, КатегорияСсылка);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентКатегории(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Категория: " + Строка(КатегорияСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыСтатья(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	СтатьяСсылка			= Справочники.БЗ_СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, СтатьяСсылка);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентСтатьи(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Статья: " + Строка(СтатьяСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыКлючевоеСлово(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСлова		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСлова);
	КлючевоеСловоСсылка		= Справочники.БЗ_КлючевыеСловаБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ИдентификаторКатегории	= ?(ПараметрыСсылки.Свойство("category"), ПараметрыСсылки.category, "");
	Если НЕ ПустаяСтрока(ИдентификаторКатегории) Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор(ИдентификаторКатегории);
		КатегорияСсылка			= Справочники.БЗ_КатегорииБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	Иначе 
		КатегорияСсылка			= Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("КлючевоеСлово", КлючевоеСловоСсылка);
	ПараметрыВыполнения.Вставить("Категория"	, КатегорияСсылка);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентКлючевогоСлова(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Ключевое слово: " + Строка(КлючевоеСловоСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыПоРейтингу(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ПараметрыПоВиду = БЗ_БазаЗнанийHTMLКлиентСервер.ПолучитьПараметрыВыводаСтраницыПоВиду(ПараметрыСсылки.name);
	
	Страница = ?(ПараметрыСсылки.Свойство("target"), ПараметрыСсылки.target, "");
	Если ПараметрыСсылки.Свойство("id") Тогда
		ИдентификаторСтатьи		= ПараметрыСсылки.id;
		УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
		СтатьяСсылка 			= Справочники.БЗ_СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	Иначе 
		СтатьяСсылка			= Неопределено;
	КонецЕсли;
	
	НомерСтраницы = ?(ПараметрыСсылки.Свойство("pagenum"), ПараметрыСсылки.pagenum, 1);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("ВидСтраницы"	, ПараметрыСсылки.name);
	ПараметрыВыполнения.Вставить("НомерСтраницы", НомерСтраницы);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентСтатьиПоРейтингу(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		ПараметрыПоВиду.Заголовок);
	
КонецФункции

Функция ПолучитьДанныеСтраницыПользователь(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	ПользовательСсылка		= Справочники.Пользователи.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Пользователь"	, ПользовательСсылка);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентПрофиляПользователя(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Пользователь: " + Строка(ПользовательСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыНовостнаяЛента(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	НомерСтраницы = ?(ПараметрыСсылки.Свойство("pagenum"), ПараметрыСсылки.pagenum, 1);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("НомерСтраницы", НомерСтраницы);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентНовостнаяЛента(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Новостная лента");
	
КонецФункции

Функция ПолучитьДанныеСтраницыНовости(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторНовости	= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторНовости);
	НовостьСсылка			= Справочники.БЗ_НовостиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
		
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, НовостьСсылка);
	
	ТекстСтраницы = БЗ_БазаЗнанийHTML.ПолучитьКонтентНовости(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Новость: " + Строка(НовостьСсылка));
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ЧАСТЕЙ СТРАНИЦ БАЗЫ ЗНАНИЙ

Функция ПолучитьДанныеОбновлениеКомментариев(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.article;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	СтатьяСсылка			= Справочники.БЗ_СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, СтатьяСсылка);
	
	Возврат БЗ_БазаЗнанийHTML.ПолучитьБлокКомментарии(ПараметрыВыполнения);
	
КонецФункции

Функция ПолучитьДанныеОбновлениеНовостнойЛенты(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ГлавнаяСтраница	= Булево(ПараметрыСсылки.mainpage);
	ПредСтраница	= Число(ПараметрыСсылки.prevpage);
	ТекСтраница		= Число(ПараметрыСсылки.currpage);
	Количество		= Число(ПараметрыСсылки.limit);
	Идентификатор	= ?(ПараметрыСсылки.Свойство("id"), ПараметрыСсылки.id, "");
	
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		УникальныйИдентификатор	= Новый УникальныйИдентификатор(Идентификатор);
		НовостиСсылка = Справочники.БЗ_НовостиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	КонецЕсли;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	
	ПараметрыВыполнения.Вставить("ГлавнаяСтраница"		, ГлавнаяСтраница);
	ПараметрыВыполнения.Вставить("Количество"			, Количество);
	ПараметрыВыполнения.Вставить("ПредыдущаяСтраница"	, ПредСтраница);
	ПараметрыВыполнения.Вставить("ТекущаяСтраница"		, ТекСтраница);
	ПараметрыВыполнения.Вставить("Ссылка"				, НовостиСсылка);
	
	Возврат БЗ_БазаЗнанийHTML.ПолучитьБлокНовости(ПараметрыВыполнения);
	
КонецФункции

Функция ПолучитьДанныеОбновленияСтатей(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ПредСтраница	= Число(ПараметрыСсылки.prevpage);
	ТекСтраница		= Число(ПараметрыСсылки.currpage);
	Количество		= Число(ПараметрыСсылки.limit);
	ВидСтраницы		= СокрЛП(ПараметрыСсылки.type);
	
	СтатьяСсылка	= Справочники.БЗ_СтатьиБазыЗнаний.ПустаяСсылка();
	Если ПараметрыСсылки.Свойство("id") Тогда
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПараметрыСсылки.id) Тогда
			УникальныйИдентификатор	= Новый УникальныйИдентификатор(ПараметрыСсылки.id);
			СтатьяСсылка = Справочники.БЗ_СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	КатегорияСсылка	= Справочники.БЗ_КатегорииБазыЗнаний.ПустаяСсылка();
	Если ПараметрыСсылки.Свойство("category") Тогда
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПараметрыСсылки.category) Тогда
			УникальныйИдентификатор	= Новый УникальныйИдентификатор(ПараметрыСсылки.category);
			КатегорияСсылка = Справочники.БЗ_КатегорииБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	
	ПараметрыВыполнения.Вставить("Количество"			, Количество);
	ПараметрыВыполнения.Вставить("ПредыдущаяСтраница"	, ПредСтраница);
	ПараметрыВыполнения.Вставить("ТекущаяСтраница"		, ТекСтраница);
	ПараметрыВыполнения.Вставить("ВидСтраницы"			, ВидСтраницы);
	ПараметрыВыполнения.Вставить("Ссылка"				, СтатьяСсылка);
	ПараметрыВыполнения.Вставить("Категория"			, КатегорияСсылка);
	
	Возврат БЗ_БазаЗнанийHTML.ПолучитьБлокСтатьи(ПараметрыВыполнения);
	
КонецФункции
